Revit 2026 API

# PrintRange Enumeration

---

An enumerated type listing all Print Range types of Print.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PrintRange
```
```vb
Public Enumeration PrintRange
```
```cpp
public enum class PrintRange
```
```fsharp
type PrintRange
```

| Member name | Value | Description |
| --- | --- | --- |
| Current | 0 | A range that represents just the currently active view. |
| Select | 2 | A range that represents a list of selected views and sheets. |
| Visible | 1 | Visible portion of current window. |

#### Reference

Autodesk.Revit.DB Namespace